Revit 2024 API
PrintManager.CopyNumber Property
 The copy number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int CopyNumber { get; set; }
Visual Basic
Public Property CopyNumber As Integer
	Get
	Set
Visual C++
public:
property int CopyNumber {
	int get ();
	void set (int value);
}
Remarks
 Returns 0 if current printer does not support CopyNumber property. The value of this property represents the global print setting property used for print operations on any document. In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which save the local changes as modifications to the global print settings.
See Also
PrintManager Class
Autodesk.Revit.DB Namespace